{
        "name": "Nhlanhla",
        "surname": "Ngcobo",
        "fullnames": "Nhlanhla Fortune Ngcobo",
        "occupation": "Intermediate Fullstack Engineer",
        "overallJobDesc" : "Hi, I ",
        "overallDev" : "AM A SOFTWARE DEVELOPER.",
        "overallCodeWars" : "LOVE CODE WARS.",
        "overallGitHub" : " KIND OF LIKE GITHUB.",
        "jobDesc": "I’m a developer with around 5 years of experience, passionate about building software that delivers real value to users. Whether working on backend or frontend development, I take pride in fulfilling requirements and ensuring the software achieves the intended results.",
        "jobDescB": "Currently, I'm a Full-Stack Engineer at Deloitte, where I contribute by developing new features, fixing bugs, and maintaining clean, scalable code that aligns with best practices. In my spare time, I enjoy working on side projects—lately, I’ve taken a growing interest in mobile development.",
        "jobDescF": "Outside of work, I’m a football fan (a proud Real Madrid and Orlando Pirates supporter), enjoy spending time with friends and family, and love playing FIFA ",
        "jobDescFB": "; I’m also a big fan of sci-fi and apocalyptic movies.",
        "jobDescCompB": "Backend Development: Implemented backend functionality using C# .NET within an MVC architecture. Responsibilities included designing and integrating interfaces, controllers, repositories, and services. Developed new features and resolved production bugs/defects based on priority from business. Front-End and Styling: Built dynamic user interfaces using React and styled components with CSS. Database Management: Utilized SQL for efficient database interactions and data handling.",
        "jobDescJAVA": "I worked on backend development using Java, primarily implementing controllers, repositories, and services. On the front-end, I used JSP for dynamic content, with HTML and CSS for styling. My role included adding new features and addressing bugs to improve the platform's functionality and reliability. I also created stored procedures to handle more complex SQL queries as needed.",
        "JobDescSAP": "Developed and maintained APIs using SAP CPI, including scripting with Groovy to document and optimize API functionality.",
        "jobDescApigee": "API Developer: Developed, deployed, and maintained APIs using the Apigee API management platform. Conducted testing with Postman and created comprehensive documentation using Swagger and API specifications. Monitored API traffic and traced failed transactions as needed. Utilized JavaScript for conditional routing and string manipulations. Integrated APIs with various backend systems, including SOAP and JSON.",
        "jobProjects": "This section will detail side projects I have been busy with, outside the work environment.",
        "About": "About",
        "Projects": "Projects",
        "Experince": "Experince",
        "PortfolioProject": "Portfolio website; This website is built with React.js Front-End. It contains multiple components that render different sections of the site. The backend is a python Back-end, this is because we're looking to impliment a chatbot that'll assist with some questions while you are on the site.",
        "SentimentsProject": "This mini-project focuses on sentiment analysis of social media posts.\nThe front end is built with ReactJS, the backend uses C# .NET, and a Python microservice runs the machine learning model responsible for processing the sentiment of the text.",
        "SentimentsProject2": "When the program loads, the user is presented with a pop-up modal allowing them to choose which ML model (Vader or Pytorch) to use.\nAfter making a selection, a text box appears where the user can enter text.\nThis input is sent to the backend, then forwarded to the microservice, which responds with the sentiment result.\nThe output is displayed as a printed statement just below the text box.",
        "SentimentsProject3": "NB; this project is still in progress but available for Demo on local."

} 